       IDENTIFICATION DIVISION.
       PROGRAM-ID. banque.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  solde USAGE COMP-1 VALUE 100 .
       01  solde_b USAGE COMP-1 VALUE 200 .
       01  compte_b PIC 9(4) VALUE 0545.
       01  compte_x PIC 9(4) VALUE 0545.
       01  montant_depot PIC 9(4)V99 COMP VALUE ZERO.
       01  montant_retrait PIC 9(4)V99 COMP.
       01  montant_virement PIC 9(4)V99.
       01  somme_a_virer PIC 9(4)V99.
       01  choix_menu PIC X.
       01  continuer PIC X.
       
       01  etoiles PIC X(50) VALUE 
           "****************************".
       01  les_plus PIC X(50) VALUE 
           "+++++++++++++++++++++++++++++++".
       01  saut_ligne PIC X(3) VALUE
           " ".
       01  tiret_menu PIC X(20) VALUE
           "-------------- ".

       PROCEDURE DIVISION.
           PERFORM UNTIL continuer = 'y'
               DISPLAY tiret_menu
               DISPLAY "     Menu "
               DISPLAY tiret_menu
               DISPLAY "Depot : 1"
               DISPLAY "Retrait : 2"
               DISPLAY "Virement : 3"
               DISPLAY "Mon solde : 4"
               DISPLAY tiret_menu
               DISPLAY "Quitter : 0"
               ACCEPT choix_menu
               EVALUATE choix_menu
                   WHEN '0'
                       DISPLAY "Merci de votre visite."
                       GOBACK
                   WHEN '1'
                       PERFORM DEPOT
                   WHEN '2'
                       PERFORM RETRAIT
                   WHEN '3'
                       PERFORM VIREMENT
                   WHEN '4'
                       PERFORM MON_SOLDE
                    WHEN OTHER
                        DISPLAY "/!\ Choix non reconnu"
               END-EVALUATE
            END-PERFORM
            GOBACK.

       DEPOT.
           PERFORM MON_SOLDE
           DISPLAY tiret_menu.
           DISPLAY "---->  depot :".
           DISPLAY tiret_menu.
           ACCEPT montant_depot.
           DISPLAY "Le DEPOT est ",montant_depot, " €".
           COMPUTE solde = solde + montant_depot.
           PERFORM NOUVEAU_SOLDE.

       RETRAIT.
           PERFORM MON_SOLDE
           DISPLAY tiret_menu.
           DISPLAY "-->  Retrait :"
           DISPLAY tiret_menu.
           ACCEPT montant_retrait
           IF solde < montant_retrait THEN
               DISPLAY "PAas assez de solde"
           ELSE
               COMPUTE solde = solde - montant_retrait
               DISPLAY "Le RETRAIT est ", montant_retrait, " €"
               PERFORM NOUVEAU_SOLDE
           END-IF.

       VIREMENT.
           PERFORM MON_SOLDE
           DISPLAY "Saisir le compte à solder:".
      *>   saisir le compte a solder : 0545    
           ACCEPT compte_x.
           if compte_x =  COMPTE_B THEN
               DISPLAY "Saisir la somme à virer:"
               ACCEPT somme_a_virer
               if SOMME_A_VIRER < solde THEN
                   COMPUTE SOLDE_B = SOLDE_B + SOMME_A_VIRER
                   COMPUTE SOLDE = SOLDE - SOMME_A_VIRER
                   DISPLAY "--> Le virement de ", 
                               SOMME_A_VIRER , 
                               " € a bien été effectué"
                   PERFORM NOUVEAU_SOLDE
                ELSE 
                   DISPLAY "Votre solde ne permet pas de virer ", 
                               SOMME_A_VIRER " €, car Votre SOLDE :", 
                               solde 
           ELSE 
               DISPLAY " Numero de compte erroné"
           END-IF.
      
       MON_SOLDE.
           DISPLAY saut_ligne.
           DISPLAY etoiles.
           DISPLAY "     Mon solde ",solde, " € ".
           DISPLAY etoiles.
           DISPLAY saut_ligne.

       NOUVEAU_SOLDE.
           DISPLAY saut_ligne.
           DISPLAY etoiles.
           DISPLAY "     Nouveau solde ",solde, " € "
           DISPLAY etoiles.
           DISPLAY saut_ligne.
         